config.org
#+TITLE: My GNU Emacs Config
#+AUTHOR: Samuel Talbot
#+DESCRIPTION: My DOOM Emacs Config
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+PROPERTY: header-args :tangle config.el
#+AUTO_TANGLE: t

* TABLE ON CONTENTS :toc:
- [[#load-packages][LOAD PACKAGES]]
- [[#org-mode][ORG MODE]]
  - [[#org-auto-tangle][Org Auto Tangle]]
  - [[#org-bullets][Org Bullets]]
- [[#things-i-need-to-sort][THINGS I NEED TO SORT]]

* LOAD PACKAGES
Adds packages to packages.el
#+begin_src elisp :tangle packages.el
(package! org-bullets)
(package! org-auto-tangle)
#+end_src

* ORG MODE
** Org Auto Tangle
#+begin_src elisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default nil))

(add-hook 'org-mode-hook 'org-auto-tangle-mode)
#+end_src

** Org Bullets
#+begin_src elisp
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

* THINGS I NEED TO SORT
#+begin_src elisp
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-one)

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

;;(org-babel-load-file
#+end_src
